cat("\f")  
rm(list=ls())
###############################################################################
# Set working directory
###############################################################################
wd <- "C:\\Users\\ASUS\\Desktop\\LEARN\\金融建模\\金融建模\\处理后的个股日回报率\\原个股日回报率"
setwd(wd)
gc()
###############################################################################
# Library
###############################################################################
library(data.table)
library(haven)
###############################################################################
# Data Insert
###############################################################################
ret1 <- fread("08-09\\TRD_Dalyr.csv")
ret2 <- fread("10-14\\TRD_Dalyr.csv")
ret3 <- fread("10-14\\TRD_Dalyr1.csv")
ret4 <- fread("10-14\\TRD_Dalyr2.csv")
ret5 <- fread("15-19\\TRD_Dalyr.csv")
ret6 <- fread("15-19\\TRD_Dalyr1.csv")
ret7 <- fread("15-19\\TRD_Dalyr2.csv")
ret8 <- fread("15-19\\TRD_Dalyr3.csv")
###############################################################################
# Merge Together
###############################################################################
ret <- rbind(ret1, ret2, ret3, ret4, ret5, ret6, ret7, ret8)
fwrite(ret, "..\\daily_return.csv")
write_dta(ret, "..\\daily_return.dta", version = 15)
